Revit 2024 API
BuiltInFailures.SiteFailures.BuildingPadOverlap Property
 Pads can't overlap (but can share edges).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BuildingPadOverlap { get; }
Visual Basic
Public Shared ReadOnly Property BuildingPadOverlap As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BuildingPadOverlap {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace